/*
    2015年11月5日10:47:12
	目的：运算符的使用细节 
*/
#include <stdio.h>

int main(void)
{
	int i = 2;
	int m;
	
	printf("%d\n", 3/2);//前面是整型，所以只取整数部分
	printf("%f\n", 3/2.0);//被除数或除数只要有一个为浮点数，商就为浮点数
	printf("%d\n", -3%2);
	printf("%d\n", 3%-2);//取余时结果的正负只与前面的数有关 
	m = (3>2) && (i=1);//后面i=1为真，如果i=0时才为假，只要i不等于0就为真 
	printf("m = %d,i = %d\n", m,i);
	
	i = 2;
	
	m = (1>2) && (i=1);
	printf("m = %d,i = %d\n", m,i);//此时输出的i=2，因为&&的左边为假，所以右边不执行 
	                               //同理，||的左边为真时，右边不执行 
	return 0;
}
/*
***************结果***************
1
1.500000
-1
1
m = 1,i = 1
m = 0,i = 2

--------------------------------
Process exited after 0.05553 seconds with return value 0
请按任意键继续. . .
*/
