/*
    2015年11月23日20:36:36
	目的：一维数组和指针的关系 
*/ 
#include <stdio.h>

void f(int * pArr, int len)//   输出任意一个数组的全部内容 
{
	int i;
	for (i = 0; i<len; i++)
	{
		printf("%d  ", *(pArr+i));// *(pArr+i)等价于pArr[i] ,等价于b[i],等价于*(b+i )
	}
	printf("\n");
} 

void g(int * pArr)
{
	pArr[2] = 100;//   pArr[2]与下面的b[2]是同一个东西 
}

int main(void)
{
	int i = 1;
	int j = 2;
	int * p = &i;
	int * q = &j;
	int a[5];
	int b[3] = {1,2,6};
	int c[5] = {5,-6,8,9,1};
	int d[100] = {12,6,999,-5};
	
	//a = &a[0];//不能这样写，因为a是常量 
	printf("%d无实际意义\n", q - p);//无实际意义
	
	p = &a[3];
	q = &a[1];
	
	printf("p和q所指向的单元相差%d个单元\n", p - q); //   指针只能相减 
	
	printf("%#X\n", &a[0]);	//一维数组名是个指针变量，存放的是数组第一个元素的地址  即a = &a[0]; 
	printf("%#X\n", a);
	
	f(b, 3);
	f(c, 5);
	f(d, 100);
	
	printf("%d\n", b[2]);
	
	g(b);
	
	printf("%d\n", b[2]);
	
	return 0; 
}
/*
***************结果***************
-1无实际意义
p和q所指向的单元相差2个单元
0X24FE10
0X24FE10
1  2  6
5  -6  8  9  1
12  6  999  -5  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0
6
100

--------------------------------
Process exited after 0.05833 seconds with return value 0
请按任意键继续. . .
*/
